pmo-dataset/variations/mermaid_basic/33.mmd
graph LR
	Task_1["Send sketches to an artist"] --> Task_9["Receive result"]
	Task_9 --> ExclusiveGateway_1{"Satisfied with result?"}
	Task_2["Tell artist to change"] --> ExclusiveGateway_2{"X"}
	ExclusiveGateway_2 --> Task_1
	StartEvent_1(("Create a 3D model")) --> ExclusiveGateway_2
	ExclusiveGateway_1 -->|"Yes"| Task_3["Choose the color"]
	Task_3 --> ExclusiveGateway_3{"In stock?"}
	ExclusiveGateway_3 -->|"Yes"| Task_4["Check color level"]
	Task_4 --> ExclusiveGateway_4{"Under 100g?"}
	ExclusiveGateway_4 -->|"Yes"| Task_12["Put it on shopping list"]
	ExclusiveGateway_4 -->|"No"| ExclusiveGateway_5{"X"}
	Task_12 --> ExclusiveGateway_5
	ExclusiveGateway_3 -->|"No"| Task_5["Order color"]
	ExclusiveGateway_5 --> ExclusiveGateway_6{"X"}
	Task_5 --> Task_11["Receive order confirmation"]
	ExclusiveGateway_6 --> Task_6["Turn on the printer"]
	Task_6 --> ParallelGateway_1{"+"}
	ParallelGateway_1 --> Task_7["Generate gcode file"]
	Task_10["Receive status"] --> ExclusiveGateway_7{"Heated?"}
	ParallelGateway_1 --> ExclusiveGateway_8{"X"}
	ExclusiveGateway_8 --> Task_10
	ExclusiveGateway_7 -->|"Yes"| ParallelGateway_2{"+"}
	Task_7 --> ParallelGateway_2
	ParallelGateway_2 --> Task_8["Print the model"]
	Task_8 --> EndEvent_1(("Model printed"))
	ExclusiveGateway_7 -->|"No"| ExclusiveGateway_8
	Task_11 --> Task_13["Color received"]
	Task_13 --> ExclusiveGateway_6
	ExclusiveGateway_1 -->|"No"| Task_2
